In [145]:
import numpy as np 
import pandas as pd

object creation

In [146]:
s = pd . Series([1,2,3,np.nan, 6,8])

constructing a series from a dict

In [147]:
d = {'a' :1, 'b' : 2, 'c' : 3}
ser = pd.Series(data = d, index= ['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

the keys of the dict match with the index values, hence the index values have no effect

In [148]:
d = {'a' :1, 'b' : 2, 'c' : 3}
ser = pd.Series(data = d, index= ['x', 'y', 'z'])   # when the index doesnt match....  generate nan values
ser

x   NaN
y   NaN
z   NaN
dtype: float64

note that the index is first build with the keys from the dictonary. After this the series is reindexed with the given index values, hence we get all NaN as the result

constructing series from a list with copy = false

In [149]:
r = [1,2]
ser = pd.Series(r, copy= False)
ser.iloc[0] = 6
ser

0    6
1    2
dtype: int64

creating dataframe by passing a numpy array, with a datetime index using date_range() and labeled columns:

In [150]:
dates = pd.date_range("20230331", periods= 6)
dates

DatetimeIndex(['2023-03-31', '2023-04-01', '2023-04-02', '2023-04-03',
               '2023-04-04', '2023-04-05'],
              dtype='datetime64[ns]', freq='D')

In [151]:
df = pd.DataFrame(np.random.randn(6,4), index= dates, columns= list("ABCD"))
df

                   A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554
2023-04-05 -1.014142  0.451059  0.571542 -1.009870

In [152]:
df2 = pd.DataFrame(
    {
    'A':1.0,
    "B": pd.Timestamp("20220331"),
    "C" : pd.Series(1, index=list(range(4)), dtype= "float32"),
    "D" : np.array([3] *4, dtype = "int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2022-03-31  1.0  3   test  foo
1  1.0 2022-03-31  1.0  3  train  foo
2  1.0 2022-03-31  1.0  3   test  foo
3  1.0 2022-03-31  1.0  3  train  foo

    VIEWING DATA

In [153]:
print(df2.head())
print(df2.tail())

     A          B    C  D      E    F
0  1.0 2022-03-31  1.0  3   test  foo
1  1.0 2022-03-31  1.0  3  train  foo
2  1.0 2022-03-31  1.0  3   test  foo
3  1.0 2022-03-31  1.0  3  train  foo
     A          B    C  D      E    F
0  1.0 2022-03-31  1.0  3   test  foo
1  1.0 2022-03-31  1.0  3  train  foo
2  1.0 2022-03-31  1.0  3   test  foo
3  1.0 2022-03-31  1.0  3  train  foo

In [154]:
df2.index
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

DataFrame.to_numpy() gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

In [155]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554
2023-04-05 -1.014142  0.451059  0.571542 -1.009870>

In [156]:
df2.to_numpy

<bound method DataFrame.to_numpy of      A          B    C  D      E    F
0  1.0 2022-03-31  1.0  3   test  foo
1  1.0 2022-03-31  1.0  3  train  foo
2  1.0 2022-03-31  1.0  3   test  foo
3  1.0 2022-03-31  1.0  3  train  foo>

In [157]:
print(df.describe())

print("\n\ndataframe 2nd")
print(df2.describe())

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.751745  0.460577  0.040160  0.193195
std    1.192133  0.712087  1.111716  0.851387
min   -1.014142 -0.224777 -1.028214 -1.009870
25%    0.048234 -0.109258 -0.918842 -0.366074
50%    0.874532  0.247038 -0.124579  0.349191
75%    1.707121  1.073087  0.846496  0.714444
max    2.018098  1.373752  1.531741  1.238960


dataframe 2nd
         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

transposing the data

In [158]:
df.T
# print(df2.T)

   2023-03-31  2023-04-01  2023-04-02  2023-04-03  2023-04-04  2023-04-05
A    2.018098    1.438660   -0.039156    1.796608    0.310405   -1.014142
B   -0.224777    1.373752    1.280429    0.043018   -0.160016    0.451059
C   -0.820699    0.938148   -1.028214    1.531741   -0.951556    0.571542
D    1.238960    0.830741    0.332827   -0.599041    0.365554   -1.009870

In [159]:
# df.sort_values(by = "A", ascending=False)
print(df.sort_index(ascending=False))

                   A         B         C         D
2023-04-05 -1.014142  0.451059  0.571542 -1.009870
2023-04-04  0.310405 -0.160016 -0.951556  0.365554
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-03-31  2.018098 -0.224777 -0.820699  1.238960

In [160]:
df2.sort_index(ascending=False)

     A          B    C  D      E    F
3  1.0 2022-03-31  1.0  3  train  foo
2  1.0 2022-03-31  1.0  3   test  foo
1  1.0 2022-03-31  1.0  3  train  foo
0  1.0 2022-03-31  1.0  3   test  foo

SELECTION

1) Getting

In [161]:
df2["D"] # equivalent to df2.D

0    3
1    3
2    3
3    3
Name: D, dtype: int32

In [162]:
df[0:3]    # which slices the rows not the columns

                   A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02 -0.039156  1.280429 -1.028214  0.332827

In [163]:
df["20230403" : "20230404"]

                   A         B         C         D
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554

selection by label

In [164]:
df

                   A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554
2023-04-05 -1.014142  0.451059  0.571542 -1.009870

In [165]:
df.loc[dates[0]]

A    2.018098
B   -0.224777
C   -0.820699
D    1.238960
Name: 2023-03-31 00:00:00, dtype: float64

In [166]:
df.loc[:,["A", "B"]]

                   A         B
2023-03-31  2.018098 -0.224777
2023-04-01  1.438660  1.373752
2023-04-02 -0.039156  1.280429
2023-04-03  1.796608  0.043018
2023-04-04  0.310405 -0.160016
2023-04-05 -1.014142  0.451059

label slicing , end points included

In [167]:
df.loc["20230331":"20230404", ["A","B"]]

                   A         B
2023-03-31  2.018098 -0.224777
2023-04-01  1.438660  1.373752
2023-04-02 -0.039156  1.280429
2023-04-03  1.796608  0.043018
2023-04-04  0.310405 -0.160016

In [168]:
df.loc["20230331" , ["A", "B"]]

A    2.018098
B   -0.224777
Name: 2023-03-31 00:00:00, dtype: float64

for getting a scaler value

In [169]:
# df.loc[dates[0], "A"] 
df.at[dates[0], "A"]  # its equivalent to prior method but fast

2.018098082933575

Selection by position

In [170]:
df

                   A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554
2023-04-05 -1.014142  0.451059  0.571542 -1.009870

In [171]:
df.iloc[3]

A    1.796608
B    0.043018
C    1.531741
D   -0.599041
Name: 2023-04-03 00:00:00, dtype: float64

In [172]:
df.iloc [3:5, 0:3]  # here [3:5 for the rows] and [0:3] for the column   and end points not included

                   A         B         C
2023-04-03  1.796608  0.043018  1.531741
2023-04-04  0.310405 -0.160016 -0.951556

In [173]:
df.iloc[[1,2,3], [0, 2]]

                   A         C
2023-04-01  1.438660  0.938148
2023-04-02 -0.039156 -1.028214
2023-04-03  1.796608  1.531741

In [174]:
df.iloc[:, 1:3]

                   B         C
2023-03-31 -0.224777 -0.820699
2023-04-01  1.373752  0.938148
2023-04-02  1.280429 -1.028214
2023-04-03  0.043018  1.531741
2023-04-04 -0.160016 -0.951556
2023-04-05  0.451059  0.571542

In [175]:
# df.iloc[2,3]
df.iat[2,3] # similar to above but fast

0.33282701140060256

BOOLEAN INDEXING

In [176]:
df["A"]

2023-03-31    2.018098
2023-04-01    1.438660
2023-04-02   -0.039156
2023-04-03    1.796608
2023-04-04    0.310405
2023-04-05   -1.014142
Freq: D, Name: A, dtype: float64

In [177]:
df[df["A"] < 0]   # those values for which df["A"] < 0

                   A         B         C         D
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-05 -1.014142  0.451059  0.571542 -1.009870

In [178]:
df[df["A"] > 0]

                   A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554

In [179]:
df[df > 0]  #where thsi boolean condition is met

                   A         B         C         D
2023-03-31  2.018098       NaN       NaN  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02       NaN  1.280429       NaN  0.332827
2023-04-03  1.796608  0.043018  1.531741       NaN
2023-04-04  0.310405       NaN       NaN  0.365554
2023-04-05       NaN  0.451059  0.571542       NaN

using isin() method for filtering

In [180]:
df2
len(df2)

4

In [181]:
df2 = df.copy()
df2["E"] = ["one", "two","three", "four","five", "six"]
df2

                   A         B         C         D      E
2023-03-31  2.018098 -0.224777 -0.820699  1.238960    one
2023-04-01  1.438660  1.373752  0.938148  0.830741    two
2023-04-02 -0.039156  1.280429 -1.028214  0.332827  three
2023-04-03  1.796608  0.043018  1.531741 -0.599041   four
2023-04-04  0.310405 -0.160016 -0.951556  0.365554   five
2023-04-05 -1.014142  0.451059  0.571542 -1.009870    six

In [182]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2023-04-01  1.438660  1.373752  0.938148  0.830741   two
2023-04-03  1.796608  0.043018  1.531741 -0.599041  four

Setting

In [183]:
s1 = pd.Series([1,2,3,4,5,6], index= pd.date_range("20230401", periods= 6))
s1

2023-04-01    1
2023-04-02    2
2023-04-03    3
2023-04-04    4
2023-04-05    5
2023-04-06    6
Freq: D, dtype: int64

In [184]:
df2["F"] = s1
df2

                   A         B         C         D      E    F
2023-03-31  2.018098 -0.224777 -0.820699  1.238960    one  NaN
2023-04-01  1.438660  1.373752  0.938148  0.830741    two  1.0
2023-04-02 -0.039156  1.280429 -1.028214  0.332827  three  2.0
2023-04-03  1.796608  0.043018  1.531741 -0.599041   four  3.0
2023-04-04  0.310405 -0.160016 -0.951556  0.365554   five  4.0
2023-04-05 -1.014142  0.451059  0.571542 -1.009870    six  5.0

In [185]:
df2.at[dates[0] , "A"] = 0
df2

                   A         B         C         D      E    F
2023-03-31  0.000000 -0.224777 -0.820699  1.238960    one  NaN
2023-04-01  1.438660  1.373752  0.938148  0.830741    two  1.0
2023-04-02 -0.039156  1.280429 -1.028214  0.332827  three  2.0
2023-04-03  1.796608  0.043018  1.531741 -0.599041   four  3.0
2023-04-04  0.310405 -0.160016 -0.951556  0.365554   five  4.0
2023-04-05 -1.014142  0.451059  0.571542 -1.009870    six  5.0

In [186]:
df2.iat[0,1] = 0
df2

                   A         B         C         D      E    F
2023-03-31  0.000000  0.000000 -0.820699  1.238960    one  NaN
2023-04-01  1.438660  1.373752  0.938148  0.830741    two  1.0
2023-04-02 -0.039156  1.280429 -1.028214  0.332827  three  2.0
2023-04-03  1.796608  0.043018  1.531741 -0.599041   four  3.0
2023-04-04  0.310405 -0.160016 -0.951556  0.365554   five  4.0
2023-04-05 -1.014142  0.451059  0.571542 -1.009870    six  5.0

In [187]:
df2.loc[:, "D"] = np.array([5] * len(df2))

C:\Users\HP\AppData\Local\Temp\ipykernel_26532\4033176749.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df2.loc[:, "D"] = np.array([5] * len(df2))

A where operation with setting

In [188]:
df3 = df.copy() 
df3 [df3 > 0] = -df3
df3

                   A         B         C         D
2023-03-31 -2.018098 -0.224777 -0.820699 -1.238960
2023-04-01 -1.438660 -1.373752 -0.938148 -0.830741
2023-04-02 -0.039156 -1.280429 -1.028214 -0.332827
2023-04-03 -1.796608 -0.043018 -1.531741 -0.599041
2023-04-04 -0.310405 -0.160016 -0.951556 -0.365554
2023-04-05 -1.014142 -0.451059 -0.571542 -1.009870

Missing data

In [189]:
df1 = df.reindex(index=dates[0:4], columns= list(df.columns) + ["E"])
df1

                   A         B         C         D   E
2023-03-31  2.018098 -0.224777 -0.820699  1.238960 NaN
2023-04-01  1.438660  1.373752  0.938148  0.830741 NaN
2023-04-02 -0.039156  1.280429 -1.028214  0.332827 NaN
2023-04-03  1.796608  0.043018  1.531741 -0.599041 NaN

In [190]:
df1.loc[dates[0]:dates[1] , "E"] = 3
df1

                   A         B         C         D    E
2023-03-31  2.018098 -0.224777 -0.820699  1.238960  3.0
2023-04-01  1.438660  1.373752  0.938148  0.830741  3.0
2023-04-02 -0.039156  1.280429 -1.028214  0.332827  NaN
2023-04-03  1.796608  0.043018  1.531741 -0.599041  NaN

DataFrame.dropna() drops any rows that have missing data:

In [191]:
df1.dropna(how="any")

                   A         B         C         D    E
2023-03-31  2.018098 -0.224777 -0.820699  1.238960  3.0
2023-04-01  1.438660  1.373752  0.938148  0.830741  3.0

dataframe.fillna() fills missing data:

In [192]:
df1.fillna(value=5)

                   A         B         C         D    E
2023-03-31  2.018098 -0.224777 -0.820699  1.238960  3.0
2023-04-01  1.438660  1.373752  0.938148  0.830741  3.0
2023-04-02 -0.039156  1.280429 -1.028214  0.332827  5.0
2023-04-03  1.796608  0.043018  1.531741 -0.599041  5.0

isna() gets a boolean mask where values are nan:

In [193]:
pd.isna(df1)

                A      B      C      D      E
2023-03-31  False  False  False  False  False
2023-04-01  False  False  False  False  False
2023-04-02  False  False  False  False   True
2023-04-03  False  False  False  False   True

Operations

stats

In [194]:
# operations in general exclude missing data
df.mean()

A    0.751745
B    0.460577
C    0.040160
D    0.193195
dtype: float64

In [195]:
df.mean(1)

2023-03-31    0.552895
2023-04-01    1.145325
2023-04-02    0.136472
2023-04-03    0.693081
2023-04-04   -0.108903
2023-04-05   -0.250353
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment.
In addition, pandas automatically broadcasts along the specified dimension:

In [196]:
s = pd.Series([1,2,3,5,np.nan,6], index=dates).shift(2)
s

2023-03-31    NaN
2023-04-01    NaN
2023-04-02    1.0
2023-04-03    2.0
2023-04-04    3.0
2023-04-05    5.0
Freq: D, dtype: float64

In [197]:
print(df)
df.sub(s,axis="index")

                   A         B         C         D
2023-03-31  2.018098 -0.224777 -0.820699  1.238960
2023-04-01  1.438660  1.373752  0.938148  0.830741
2023-04-02 -0.039156  1.280429 -1.028214  0.332827
2023-04-03  1.796608  0.043018  1.531741 -0.599041
2023-04-04  0.310405 -0.160016 -0.951556  0.365554
2023-04-05 -1.014142  0.451059  0.571542 -1.009870

                   A         B         C         D
2023-03-31       NaN       NaN       NaN       NaN
2023-04-01       NaN       NaN       NaN       NaN
2023-04-02 -1.039156  0.280429 -2.028214 -0.667173
2023-04-03 -0.203392 -1.956982 -0.468259 -2.599041
2023-04-04 -2.689595 -3.160016 -3.951556 -2.634446
2023-04-05 -6.014142 -4.548941 -4.428458 -6.009870

domonestation of above example

In [198]:
df4 = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [40, 50, 60],
    'C': [70, 80, 90]
}
)
s2 = pd.Series([1, 2, 3])

If you are getting NaN values for all elements when subtracting a Series from a DataFrame along the "columns" axis, it is likely because the Series and DataFrame do not have the same column labels. When subtracting along the "columns" axis, pandas aligns the Series with the columns of the DataFrame based on their labels. If the labels do not match, pandas will not be able to perform the subtraction and will instead return NaN for all elements.

In [199]:
df4.sub(s2, axis="index")

    A   B   C
0   9  39  69
1  18  48  78
2  27  57  87

Apply


DataFrame.apply() applies a user defined function to the data